{
  "HamburgerMenu": {
    "nas_rad": "Projects",
    "o_nama": "About",
    "usluge": "Services",
    "kontakt": "Contact",
    "karijera": "Careers"
  },
  "Navbar": {
    "nas_rad": "Projects",
    "o_nama": "About"
  },
  "HomePage": {
    "ko_smo_mi": "Who we are",
    "sta_radimo": "What we do"
  },
  "ServicesPage": {
    "usluge": "Services",
    "uslugeNaslov": "Kata Studio develops comprehensive visual solutions — from concept to execution — with a focus on:",
    "kreativni_koncepti_i_umjetnička_direkcija": {
      "title": "Creative Concepts & Art Direction",
      "description": "Defining creative direction, shaping narratives, and establishing the visual tone of each project—from strategic inception to final art direction. Whether we’re working on a brand, campaign, exhibition, or film, we build visual worlds that are both intentional and immersive."
    },
    "brending_i_stratesko_pozicioniranje": {
      "title": "Brand Strategy & Positioning",
      "description": "Long-term brand development strategies that articulate a brand’s core values, voice, and purpose. Through research, insight, and creative direction, we help brands define authentic identities and build meaningful, enduring relevance."
    },
    "vizuelni_identitet_i_dizajn_sistemi": {
      "title": "Visual Identity & Design Systems",
      "description": "We create distinct and coherent visual identities—logos, typography, color palettes, layout principles, and beyond. Each identity is built as a functional, scalable system that ensures consistency and creative flexibility across platforms."
    },
    "naming_i_komunikacijska_arhitektura": {
      "title": "Naming & Communication Architecture",
      "description": "Name developing with strategic depth—resonant in meaning, sound, and cultural relevance. In parallel, we build communication logic that structures how messages are framed, delivered, and received."
    },
    "produkt_i_dizajn_ambalaze": {
      "title": "Product & Packaging Design",
      "description": "Our product and packaging design extends the brand experience through form and tactility. Every detail is a deliberate gesture that builds emotional connection, communicates value, and stands out through visual impact."
    },
    "editorial_i_dizajn_publikacija": {
      "title": "Editorial & Publication Design",
      "description": "We design books, catalogs, and editorial formats with refined rhythm, typography, and narrative structure. Our work balances content with form—creating publications that are both engaging and deeply considered."
    },
    "prostorni_i_ambijentalni_dizajn": {
      "title": "Spatial & Environmental Design",
      "description": "From exhibitions and installations to interiors and interventions in public space, we design environments that embody ideas. We shape spatial experiences that inform, inspire, and connect."
    },
    "primijenjena_umjetnost": {
      "title": "Applied Arts",
      "description": "Research of the intersection of artistic expression and practical form—we create unique, hand-crafted objects that blend painting, sculpture, and installation. Our applied arts extend visual narratives through material, texture, and shape."
    },
    "digitalni_dizajn_i_razvoj": {
      "title": "Digital Design & Development",
      "description": "Designing and developing websites where function and aesthetics converge. Through intuitive UX/UI and precise front-end execution, we deliver digital experiences that are visually refined, accessible, and purpose-driven."
    },
    "fotografija_i_video_produkcija": {
      "title": "Photography & Video Production",
      "description": "We offer a full-spectrum creative approach to photography and video—from concept, through production to post-production. Our work communicates with clarity and visual intent, documenting stories that resonate and inspire."
    },
    "animacija_i_pokretna_grafika": {
      "title": "Animation & Motion Design",
      "description": "Special emphasis is placed on 3D animation—from modeling and texturing to animating complex sequences. Motion design becomes a storytelling tool, enhancing digital narratives, campaigns, and presentations with rhythm, clarity, and movement."
    },
    "imerzivna_iskustva": {
      "title": "Immersive Experiences: VR / AR / XR",
      "description": "We create immersive formats that blend space, technology, and interaction. Whether virtual exhibitions or augmented narratives, we craft new forms of engagement that expand storytelling into experiential dimensions."
    },
    "dogadjaji_i_iskustveni_dizajn": {
      "title": "Experiential & Event Design",
      "description": "With paying special attention to conceptualisation and production of  events that communicate brand values through atmosphere, narrative, and intentional user journeys, we put extensive effort to make every detail curated to deliver a cohesive, memorable experience for our customers and audience."
    }
  },
  "AboutPage": {
    "o_nama": "About us",
    "o_nama_naslov": "We craft brands, design experiences, and build digital presence.",
    "o_nama_paragrafi": [
      "Kata studio is a global design studio shaping brand identities, digital products, and spatial systems for brands, creators, institutions, and the cultural sector worldwide.",
      "At Kata studio we craft design-driven identities, products, and spaces that tell compelling stories and shape meaningful visual experiences.",
      "Leveraging market-leading capabilities, we develop cross-disciplinary design systems that seamlessly integrate strategy, narrative, and technology. Our approach fuses functional design with contextual insight, ensuring every brand and project is precisely positioned within its ecosystem.",
      "Combining strategy, design, and production into a unified creative process, we collaborate with individuals and institutions through bold and strategic communication.",
      "Together, we create impact."
    ]
  },
  "ContactPage": {
    "kontakt": "Contact",
    "pronadjite_nas": "Find us",
    "ime": "Fullname",
    "ime_placeholder": "Your fullname",
    "preduzece": "Company",
    "preduzece_placeholder": "Your company",
    "tema": "Subject",
    "tema_placeholder": "Choose subject",
    "mail": "Mail",
    "mail_placeholder": "E-mail address",
    "poruka": "Message",
    "pisite_ovdje": "Start typing here...",
    "crna_gora_evropa": "Crna Gora, Evropa",
    "pozdravi_nas": "Say hello",
    "posalji": "Submit",
    "notifications": {
      "success_poruka": "Your message has been successfully sent. We will get back to you soon!",
      "error_poruka": "Something went wrong while sending your message. Please try again later.",
      "slanje": "Sending...",
      "server_error": "A technical error occurred on the server. Please try again later or contact us directly."
    },
    "errors": {
      "ime": "Please enter your name.",
      "tema": "Please enter a topic.",
      "preduzece": "Please enter your company name.",
      "mail_prazan": "Please enter your email address.",
      "mail_format": "The email address is not valid.",
      "poruka": "Please enter your message."
    }
  },
  "ProjectPage": {
    "projekti": "Projects"
  }
}
